#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_ssm_parameter.ssh_key: Reading...
aws_iam_policy.ssm_controlplane_policy: Refreshing state... [id=arn:aws:iam::767398122881:policy/rs-ssm-controlplane-policy-dev]
aws_iam_policy.ssm_worker_policy: Refreshing state... [id=arn:aws:iam::767398122881:policy/rs-ssm-worker-policy-dev]
aws_iam_role.vpc_flow_logs_role: Refreshing state... [id=rs-vpc-flow-logs-role-dev]
aws_iam_role.worker_role: Refreshing state... [id=rs-worker-role-dev]
aws_iam_role.bastion_role: Refreshing state... [id=rs-bastion-role-dev]
aws_eip.nat: Refreshing state... [id=eipalloc-0ca6f2b3bae992fb3]
data.aws_ami.ubuntu: Reading...
aws_iam_policy.ssm_bastion_policy: Refreshing state... [id=arn:aws:iam::767398122881:policy/rs-ssm-bastion-policy-dev]
aws_vpc.main: Refreshing state... [id=vpc-0c7ed8f67d0155a4b]
data.aws_ssm_parameter.ssh_key: Read complete after 0s [id=/development/KEYPAIR]
aws_kms_key.cloudwatch: Refreshing state... [id=1b5cb976-4b02-4dff-92b3-8173fe8fa691]
aws_iam_role.controlplane_role: Refreshing state... [id=rs-controlplane-role-dev]
aws_cloudwatch_log_group.vpc_flow_logs: Refreshing state... [id=/aws/vpc/flow-logs]
local_file.ssh_key: Refreshing state... [id=4edc0d98a397011e99505d24aad17357304656d0]
data.aws_ami.ubuntu: Read complete after 1s [id=ami-0d4d7e98021b6b9a6]
aws_iam_role_policy_attachment.ssm_worker_attach: Refreshing state... [id=rs-worker-role-dev-20250626000530019400000002]
aws_iam_instance_profile.worker_profile: Refreshing state... [id=rs-worker-instance-profile-dev]
aws_iam_role_policy_attachment.ssm_attach: Refreshing state... [id=rs-bastion-role-dev-20250626000530129000000003]
aws_iam_instance_profile.ssm_profile: Refreshing state... [id=rs-bastion-instance-profile-dev]
aws_iam_role_policy_attachment.vpc_flow_logs_policy: Refreshing state... [id=rs-vpc-flow-logs-role-dev-20250625234539117300000001]
aws_iam_role_policy_attachment.ssm_controlplane_attach: Refreshing state... [id=rs-controlplane-role-dev-20250626000530010800000001]
aws_iam_instance_profile.controlplane_profile: Refreshing state... [id=rs-controlplane-instance-profile-dev]
aws_internet_gateway.igw: Refreshing state... [id=igw-09f8b33ca2a990c2a]
aws_security_group.bastion_sg: Refreshing state... [id=sg-072df0055ab58c138]
aws_subnet.private[0]: Refreshing state... [id=subnet-0498943ff7beb9c31]
aws_security_group.vm_private_sg: Refreshing state... [id=sg-079dbc88f71c17641]
aws_flow_log.vpc_flow: Refreshing state... [id=fl-0c8ae145e266d6b17]
aws_subnet.public[0]: Refreshing state... [id=subnet-0af42ee7da056f68a]
aws_subnet.private[1]: Refreshing state... [id=subnet-040f06f7b4fe71f22]
aws_security_group.vm_public_sg: Refreshing state... [id=sg-0cb488c986304620f]
aws_subnet.public[1]: Refreshing state... [id=subnet-0d8d6b1fed8cca154]
aws_route_table.public: Refreshing state... [id=rtb-0a6be062e1f8344b6]
aws_network_acl.private: Refreshing state... [id=acl-0ab9a70bb65beea92]
aws_instance.k3s_control_plane: Refreshing state... [id=i-004bc6c836bf6cd48]
aws_instance.k3s_worker: Refreshing state... [id=i-0ae8202bdb4aa1c7b]
aws_nat_gateway.natgw: Refreshing state... [id=nat-054b9433cac89e691]
aws_network_acl.public: Refreshing state... [id=acl-0b6b75f567aaf7e9a]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-04d220a662862500a]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0c848ad50a8f32ec5]
aws_instance.bastion: Refreshing state... [id=i-028d71ac0b3442fb4]
aws_network_acl_rule.private_outbound_all: Refreshing state... [id=nacl-4238232095]
aws_network_acl_rule.private_inbound_ephemeral: Refreshing state... [id=nacl-1238734886]
aws_network_acl_rule.private_inbound_all_vpc: Refreshing state... [id=nacl-3593097250]
aws_network_acl_rule.private_inbound_icmp_vpc: Refreshing state... [id=nacl-3127084623]
aws_network_acl_rule.public_inbound_all: Refreshing state... [id=nacl-916360661]
aws_network_acl_rule.public_outbound_all: Refreshing state... [id=nacl-2645205781]
aws_route_table.private: Refreshing state... [id=rtb-03fcc62d95c0118a8]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-06fac2bf6b809e697]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-088fd966236b7a860]
null_resource.provision_k3s_control_plane: Refreshing state... [id=4228203272784686244]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # local_file.ssh_key will be created
  + resource "local_file" "ssh_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0600"
      + filename             = "./blackbird.pem"
      + id                   = (known after apply)
    }

  # null_resource.provision_k3s_control_plane is tainted, so must be replaced
-/+ resource "null_resource" "provision_k3s_control_plane" {
      ~ id = "4228203272784686244" -> (known after apply)
    }

  # null_resource.provision_k3s_worker will be created
  + resource "null_resource" "provision_k3s_worker" {
      + id = (known after apply)
    }

Plan: 3 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: output.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "output.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @isbelevtsov, Action: `pull_request`, Working Directory: `task_3/project`, Workflow: `Terraform Plan and Apply`*